smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/demoapp/src/DemoApp.c
/******************************************************************************
**                                                                           **
** Copyright (C) Infineon Technologies (2013)                                **
**                                                                           **
** All rights reserved.                                                      **
**                                                                           **
** This document contains proprietary information belonging to Infineon      **
** Technologies. Passing on and copying of this document, and communication  **
** of its contents is not permitted without prior written authorization.     **
**                                                                           **
*******************************************************************************
**                                                                           **
**  $FILENAME   : DemoApp.c $                                                **
**                                                                           **
**  $CC VERSION : \main\94 $                                                 **
**                                                                           **
**  $DATE       : 2015-11-02 $                                               **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **
**  VENDOR      : Infineon Technologies                                      **
**                                                                           **
**  DESCRIPTION : This file contains                                         **
**                - sample Demo Test for all the  modules                    **
**                                                                           **
**  MAY BE CHANGED BY USER [yes/no]: Yes                                     **
**                                                                           **
******************************************************************************/

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
#include "Std_Types.h"
#include "Mcal.h"
#include "Mcal_Options.h"
#include "IfxCpu_reg.h"
#include "Test_Print.h"
#include "Test_Time.h"
#include "Test_Main.h"
#include "DemoApp_Cfg.h"
#if (PORT_DELIVERY == STD_ON)
#include "Port.h"
#endif
#include "DemoApp_FctCall.h"

/*******************************************************************************
**                      Imported Compiler Switch Check                        **
*******************************************************************************/
/* Module header files _ Module_Demo.h will include the Module.h*/
#if (MCU_DELIVERY == STD_ON)
#include "Mcu.h"
#include "Mcu_Demo.h"
#endif

#if (HSSL_DELIVERY == STD_ON)
#include "Hssl_Demo.h"
#endif

#if (DIO_DELIVERY == STD_ON)
#include "Dio.h"
#include "Dio_Demo.h"
#endif

#if (GPT_DELIVERY == STD_ON)
#include "Gpt_Demo.h"
#endif

#if (SPI_DELIVERY == STD_ON)
#include "Spi_Demo.h"
#endif

#if (PWM_DELIVERY == STD_ON)
#include "Pwm_17_Gtm_Demo.h"
#endif

#if (ADC_DELIVERY == STD_ON)
#include "Adc_Demo.h"
#endif

#if (ICU_DELIVERY == STD_ON)
#include "Icu_17_GtmCcu6_Demo.h"
#endif

#if (WDG_DELIVERY == STD_ON)
#include "Wdg_17_Scu_Demo.h"
#endif

#if (FLS_DELIVERY == STD_ON)
#include "Fls_17_Pmu_Demo.h"
#endif

#if (FLSLOADER_DELIVERY == STD_ON)
#include "FlsLoader_Demo.h"
#endif

#if (FEE_DELIVERY == STD_ON)
#include "Fee_Demo.h"
#endif

#if (GTM_DELIVERY == STD_ON)
#include "Gtm_Demo.h"
#endif

#if (CAN_DELIVERY == STD_ON)
#include "Can_17_MCanP_Demo.h"
#endif

#if (FR_DELIVERY == STD_ON)
#include "Fr_17_Eray_Demo.h"
#endif

#if (LIN_DELIVERY == STD_ON)
#include "Lin_17_AscLin_Demo.h"
#endif

#if (ETH_DELIVERY == STD_ON)
#include "Eth_17_EthMac_Demo.h"
#endif

#if (CRC_DELIVERY == STD_ON)
#include "Crc_Demo.h"
#endif

#if (MSC_DELIVERY == STD_ON)
#include "Msc_Demo.h"
#endif

#if (UART_DELIVERY == STD_ON)
#include "Uart_Demo.h"
#endif

#if (SENT_DELIVERY == STD_ON)
#include "Sent_Demo.h"
#endif

#if (STM_DELIVERY == STD_ON)
#include "Stm_Demo.h"
#endif

#if (IOM_DELIVERY == STD_ON)
#include "Iom_Demo.h"
#endif

#if (DMA_DELIVERY == STD_ON)
#include "Dma_Demo.h"
#endif

#ifdef BFX_DELIVERY
#if (BFX_DELIVERY == STD_ON)
#include "Bfx_Demo.h"
#endif
#endif

#if (STDLIN_DELIVERY == STD_ON)
#include "StdLin_Demo.h"
#endif

#if (DSADC_DELIVERY == STD_ON)
#include "Dsadc_Demo.h"
#endif

#if (I2C_DELIVERY == STD_ON)
#include "I2c_Demo.h"
#endif

#ifdef HSM_DELIVERY
#if (HSM_DELIVERY == STD_ON)
#include "Hsm_Demo.h"
#endif
#endif

/*******************************************************************************
**               Private Macro Definitions                                    **
*******************************************************************************/
#define CPU_PSW_USER_MODE_MASK (0xFFFFF3FFU)
#define SET_USER_MODE_MASK ((1U  <<  10U))
#define SET_SUPERVISORY_MODE_MASK (1U  <<  11U)
/*******************************************************************************
**                      Private Type Definitions                              **
*******************************************************************************/



/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/
void DemoApp(void);
void DemoApp_PrintChoices(void);
void DemoApp_CallAnyFct (char *my_fct_name);
void DemoApp_CallMenuFct  (char *my_fct_name) __attribute__ ((noinline));


void DemoApp_GotoDemoMenu(void);

void DemoApp_GotoMainMenu(void);
void DemoApp_DummyFct(void);
#ifdef CALL_BY_FUNCTION_AVAILABLE
uint32 DemoApp_GetIndex (char *my_fct_name,
                         DemoApp_AnyFctListType const *list,
                         uint32 list_size);
void DemoApp_GotoAnyFctMenu(void);
void DemoApp_ListFct(void);
#endif
#if (IFX_SAFETLIB_USED == STD_ON)
_EXTERN_ void RA_DisableCyclicTest(void);
_EXTERN_ void RA_SetupDTI(void);
#endif
/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/
const DemoApp_FctListType DemoApp_FctList[] =
{
  {" "  , DemoApp_DummyFct, "............ AUTOSAR DRIVERS..............."},
  #if (MCU_DELIVERY == STD_ON)
  {"0"  ,Mcu_SWResetDemo, "  MCU: Mcu_Reset,Software Reset"},
  {"1"  ,Mcu_GetResetReasonDemo, "  MCU: Mcu_Reset,Get Reset Reason"},
  #if (MCU_SAFETY_ENABLE == STD_ON) && (MCU_INITCHECK_API == STD_ON)
  {"a"  ,Mcu_InitCheckDemo, "  MCU: Verify MCU Initialization"},
  #endif
  #if (MCU_SET_STANDBY_CONTROL_API == STD_ON)
  {"b", Mcu_GotoStandbyDemoMenu, "  MCU Standby Menu"},
  #endif
  #endif
  #if (DIO_DELIVERY == STD_ON)
  {"2"  ,DemoApp_Dio, "  DIO: Demo For DIO Driver"},
  #endif
  #if (GPT_DELIVERY == STD_ON)
  {"3"  ,Gpt_StartDemo, "  GPT:StartContinuousTimer : LED must start blinking for Every 4 Seconds."},
  {"4"  ,Gpt_StopDemo, "  GPT:StopTimer:LED must stop blinking. "},
  #endif
  #if (PWM_DELIVERY == STD_ON)
  {"5"  ,Pwm_17_Gtm_StartDemo, "  PWM: Start PWM,Default DutyCycle :50%"},
  {"6"  ,Pwm_17_Gtm_ChangeDutyDemo, "  PWM: Enter New DutyCycle as 0 NewDC:"},
  {"7"  ,Pwm_17_Gtm_DemoDisableNotification, "  PWM: Stop  PWM "},
  #endif
  #if (ICU_DELIVERY == STD_ON)
  {"8"  ,Icu_17_GtmCcu6_Demo, "  ICU: Read the PWM Duty Cycle and Period"},
  #endif
  #if (ADC_DELIVERY == STD_ON)
  {"9"  ,Adc_SWGroupDemo, "  ADC:Start ADC SW group: AdcSWGroup"},
  #endif
  #if (WDG_DELIVERY == STD_ON)
  {"c",Wdg_17_Scu_Demo, "  WDG: WDG Demo"},
  #endif
  #if (SPI_DELIVERY == STD_ON)
  {"d",Spi_EepromAccessDemo, "  SPI:EEPROM Demo using QSPI"},
  #endif
  #if (ETH_DELIVERY == STD_ON)
  {"e",Eth_17_Demo, "  ETH: ETH Demo "},
  #endif
  #if (FLS_DELIVERY == STD_ON)
  {"f",Fls_17_Pmu_Demo, "  FLS: Demo"},
  #endif
  #if (FEE_DELIVERY == STD_ON)
  {"g",Fee_Demo, "  FEE: Demo"},
  #endif
  #if (GTM_DELIVERY == STD_ON)
  {"k",Gtm_Demo, "  GTM:GTM PWM Signal Generation"},
  #endif
  #if (LIN_DELIVERY == STD_ON)
  {"l",Lin_Demo, "  LIN  Demo "},
  #endif
  #if (CAN_DELIVERY == STD_ON)
  {"m",Can_17_MCanP_Demo, "  CAN: Demo"},
  #endif
  #if (STDLIN_DELIVERY == STD_ON)
  {"n",StdLin_Demo, "  StdLin:  Demo "},
  #endif
  #if (FLSLOADER_DELIVERY == STD_ON)
  {"o",FlsLoader_Demo, "  FLS_LOADER: Demo"},
  #endif
  #if (MSC_DELIVERY == STD_ON)
  {"p",Msc_Demo, "  MSC: Demo"},
  #endif
  #if (FR_DELIVERY == STD_ON)
  #ifdef FR_17_ERAY_PBCFG_0
  {"s",Fr_17_Eray_Demo, "  FlexRay Demo"},
  #endif
  #endif
  #if (DMA_DELIVERY == STD_ON)
  {"t",Dma_Demo, "  DMA  Demo "},
  #endif
  #if (UART_DELIVERY == STD_ON)
  {"u",Uart_Demo, "  UART Demo"},
  #endif
  #if (CRC_DELIVERY == STD_ON)
  {"x",Crc_Demo, "  CRC  Demo "},
  #endif
  #if (STM_DELIVERY == STD_ON)
  {"y",Stm_StartDemo, "  STM  Demo "},
  #endif
  #if (SENT_DELIVERY == STD_ON)
  {"z",Sent_StartDemo, "  SENT  Demo "},
  #endif
  #if (IOM_DELIVERY == STD_ON)
  {"$",Iom_Demo, "  IOM  Demo "},
  #endif
  #ifdef BFX_DELIVERY
  #if (BFX_DELIVERY == STD_ON)
  {"j",Bfx_Demo, "  Bfx  Demo "},
  #endif
  #endif
  #if (HSSL_DELIVERY == STD_ON)
  {"A"  ,Hssl_Demo, "  HSSL Demo"},
  #endif
  #if ((DIO_DELIVERY == STD_ON) && ((GPT_DELIVERY == STD_ON)))
  #if ( MCAL_NO_OF_CORES > 1U )
  {"h",Gpt_MCDemo, "  Multicore Demo "},
  #endif
  #endif
  #if (DSADC_DELIVERY == STD_ON)
  {"I",Dsadc_Demo, "  DSADC Demo "},
  #endif
  #if (I2C_DELIVERY == STD_ON)
  {"J",I2c_Demo, "  I2c Demo "},
  #endif
  #ifdef HSM_DELIVERY
  #if (HSM_DELIVERY == STD_ON)
  {"H",Hsm_Demo, "  HSM Demo "},
  #endif
  #endif
  { ".", DemoApp_GotoMainMenu , "Goto main menu" }

