smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/demoapp/src/DemoApp.c
};

const DemoApp_MenuType DemoApp_DemoMenu=
{
  sizeof(DemoApp_FctList) / sizeof(DemoApp_FctListType),
  &DemoApp_FctList[0]
};

const DemoApp_FctListType DemoApp_MainList[]=
{
  { " " , DemoApp_DummyFct             , "------------- MAIN Menu ------------- "  },
  { "0" , DemoApp_GotoDemoMenu,   "go to Demo List"  },
#ifdef CALL_BY_FUNCTION_AVAILABLE
  { "1" , DemoApp_GotoAnyFctMenu,  "Call any function"  },
#endif
  #if (IFX_SAFETLIB_USED == STD_ON)
  { "2" , RA_SetupDTI,  "SafeTlib- Enable Cyclic tests"  },
  { "3" , RA_DisableCyclicTest,  "SafeTlib- Enable PostRun tests (Disable Cyclic tests)"  },
  #endif
};
const DemoApp_MenuType DemoApp_MainMenu=
{
  sizeof(DemoApp_MainList) / sizeof(DemoApp_FctListType),
  &DemoApp_MainList[0]
};

#ifdef CALL_BY_FUNCTION_AVAILABLE
const DemoApp_FctListType DemoApp_AnyFctList[]=
{
  { " " , DemoApp_DummyFct             , "------------- CALL any function ------------- "  },
  { "xx", DemoApp_DummyFct             , "Type the name the function you want to call" },
  { "1" , DemoApp_ListFct      , "list all available functions" },
  { ".", DemoApp_GotoMainMenu , "Goto main menu" },
};
const DemoApp_MenuType DemoApp_AnyFct_menu=
{
  sizeof(DemoApp_AnyFctList) / sizeof(DemoApp_FctListType),
  &DemoApp_AnyFctList[0]
};
#endif
/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/
DemoApp_MenuType const *DemoApp_Menu_p;
char szString[80];
uint32 str_pos; /* position of the pointer in the receive buffer */
char fct_str[35];
uint32 uwData[4];
volatile uint32 DemoApp_LedGlowDur = 0xFFFFFFFF;
volatile uint8 DemoApp_GlowLed;

/*******************************************************************************
**                      Private  Constant Definitions                         **
*******************************************************************************/


/*******************************************************************************
**                     Private  Variable Definitions                          **
*******************************************************************************/
/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/
/*******************************************************************************
** Syntax : void DemoApp(void)                                                **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Non Reentrant                                              **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : Demo Tests for all the delivered Modules.                    **
*******************************************************************************/
void DemoApp(void)
{
/*******************************************************************************
**                    Menu options on the hyperterminal                       **
*******************************************************************************/

#ifdef CALL_BY_FUNCTION_AVAILABLE
  uint32 cnt;
#endif
  int char_val;

  DemoApp_Menu_p = &DemoApp_MainMenu;
  str_pos=0;

  print_flushfifo();

  #if (FR_DELIVERY == STD_ON)
#ifdef FR_17_ERAY_PBCFG_1
  /*
    Call FlexRay node 1 demo application. This application infinitely
    waits for Flexray node 0 to synchronise and transmit/receive data.
    This is done in an infinite loop, so it never goes to next statement in
    this program.
    Preprocessor switch FR_17_ERAY_PBCFG_1 is defined during build time.
  */
  Fr_17_Eray_Demo();
#endif
#endif


  DemoApp_PrintChoices();
  print_f("\nEnter Option Number: ");
  for (;;)
  {
    char_val = getlineWithPos(szString, sizeof szString - 1,&str_pos);
    if (char_val == CR)
    {
    str_pos = 0;
    print_f("\n\n");
    DemoApp_CallMenuFct(szString);
    DemoApp_PrintChoices();
      print_f("\nEnter Option Number: ");
    }
#ifdef CALL_BY_FUNCTION_AVAILABLE
    else if (char_val == TAB && DemoApp_Menu_p == &DemoApp_AnyFct_menu)
    {
      cnt = DemoApp_GetIndex(szString,DemoApp_AllFctList,DemoApp_AnyFctListSize);
      if(cnt<DemoApp_AnyFctListSize)
      {
        /* if the name correspond exactly to a name of the list, propose the
        next one */
        cnt++;
        if ( cnt >= DemoApp_AnyFctListSize)
        {
          cnt = 0;
        }
        erase_line(szString,&str_pos);
        put_buffer(szString, sizeof szString - 1,
                   DemoApp_AllFctList[cnt].fct_name,&str_pos);
      }
      else if (cnt & 0x80000000)
      {
        /* the name does not exist in the list, propose the nearest one's */
        cnt = cnt & 0x7FFFFFFF;
        erase_line(szString,&str_pos);
        put_buffer(szString, sizeof szString - 1,
                   DemoApp_AllFctList[cnt].fct_name,&str_pos);
      }
    }
#endif

  }
}/*End of Demo App */

/*******************************************************************************
** Syntax : void DemoApp_CallMenuFct(char *)                                  **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Non Reentrant                                              **
**                                                                            **
** Parameters (in): char describing the function                              **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : call the demo function corresponding to the parameter        **
*******************************************************************************/
void DemoApp_CallMenuFct (char *my_fct_name)
{

uint32 cnt;
uint32 cnt_max = DemoApp_Menu_p->size;
#ifdef IFX_MCAL_RUN_MODE_DEFINE
/* IFX_MCAL_RUN_MODE_DEFINE = 0 indicates MCAL,
  runs in Supervisor mode*/
#if(IFX_MCAL_RUN_MODE_DEFINE != 0U)
/* Set the user-1 mode on*/
uint32 Cpu_PSW;
#endif 
#endif 

#if ((STDLIN_DELIVERY == STD_ON) || (HSSL_DELIVERY == STD_ON) || \
       (FLSLOADER_DELIVERY == STD_ON)|| (ETH_DELIVERY == STD_ON) || \
       (LIN_DELIVERY == STD_ON) ||\
       ((FR_DELIVERY == STD_ON) &&  (defined(FR_17_ERAY_PBCFG_0))))
boolean IsModInitReqSVMode = FALSE; /* STDLIN,FR,LIN and ETH demo calls 
    init in the demo functions so move to user mode will be made by the 
    respective module*/
#endif

#if (FLSLOADER_DELIVERY == STD_ON)
demo_fct_type FlsloaderDemoFn;
#endif

#if (HSSL_DELIVERY == STD_ON)
demo_fct_type HsslDemoFn;
#endif

#if (ETH_DELIVERY == STD_ON)
demo_fct_type EthDemoFn;
#endif

#if (LIN_DELIVERY == STD_ON)
demo_fct_type LinDemoFn;
#endif

