smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/demoapp/src/DemoApp.c
#if (STDLIN_DELIVERY == STD_ON)
demo_fct_type StdLinDemoFn;
#endif

#if (FR_DELIVERY == STD_ON)
#ifdef FR_17_ERAY_PBCFG_0
demo_fct_type FrDemoFn;
#endif
#endif
  for (cnt=0;cnt<cnt_max;cnt++)
  {
    if(DemoApp_Menu_p->list[cnt].fct_name[0] == my_fct_name[0])
    {
        #if (FLSLOADER_DELIVERY == STD_ON)
        FlsloaderDemoFn = &FlsLoader_Demo;
        if(DemoApp_Menu_p->list[cnt].fct_p == FlsloaderDemoFn)
          {
            IsModInitReqSVMode = TRUE;
          }
        #endif
       
        #if (STDLIN_DELIVERY == STD_ON)
        StdLinDemoFn = &StdLin_Demo;
        if(DemoApp_Menu_p->list[cnt].fct_p == StdLinDemoFn)
          {
            IsModInitReqSVMode = TRUE;
          }
        #endif

        #if (ETH_DELIVERY == STD_ON)
        EthDemoFn = &Eth_17_Demo;
        if(DemoApp_Menu_p->list[cnt].fct_p == EthDemoFn)
          {
            IsModInitReqSVMode = TRUE;
          }
        #endif
        
        #if (LIN_DELIVERY == STD_ON)
        LinDemoFn = &Lin_Demo;
        if(DemoApp_Menu_p->list[cnt].fct_p == LinDemoFn)
          {
            IsModInitReqSVMode = TRUE;
          }
        #endif
        
        #if (HSSL_DELIVERY == STD_ON)
        HsslDemoFn = &Hssl_Demo;
        if(DemoApp_Menu_p->list[cnt].fct_p == HsslDemoFn)
          {
            IsModInitReqSVMode = TRUE;
          }
        #endif

        #if (FR_DELIVERY == STD_ON)
        #ifdef FR_17_ERAY_PBCFG_0
        FrDemoFn = &Fr_17_Eray_Demo;
        if(DemoApp_Menu_p->list[cnt].fct_p == FrDemoFn)
          {
            IsModInitReqSVMode = TRUE;
          }
        #endif
        #endif

        #if ((STDLIN_DELIVERY == STD_ON) || (HSSL_DELIVERY == STD_ON) || \
                 (FLSLOADER_DELIVERY == STD_ON) || (ETH_DELIVERY == STD_ON) ||\
                 (LIN_DELIVERY == STD_ON) ||\
                    ((FR_DELIVERY == STD_ON) && (defined(FR_17_ERAY_PBCFG_0))))
        if (IsModInitReqSVMode == FALSE)
        #endif
          {
            #ifdef IFX_MCAL_RUN_MODE_DEFINE
            /* IFX_MCAL_RUN_MODE_DEFINE = 0 indicates MCAL,
              runs in Supervisor mode*/
            #if(IFX_MCAL_RUN_MODE_DEFINE != 0U)
            /* Set the user-1 mode on*/
            Cpu_PSW = (uint32)MFCR(CPU_PSW);
            Cpu_PSW = (Cpu_PSW & CPU_PSW_USER_MODE_MASK);
            Cpu_PSW = (Cpu_PSW | SET_USER_MODE_MASK);
            MTCR(CPU_PSW, Cpu_PSW); /* Set mode to user-1 mode. */
            #endif /* IFX_MCAL_RUN_MODE_DEFINE */
            #endif /* IFX_MCAL_RUN_MODE_DEFINE */
          }
        (* DemoApp_Menu_p->list[cnt].fct_p)();

        return;
    }
  }

#ifdef CALL_BY_FUNCTION_AVAILABLE
  if(DemoApp_Menu_p == &DemoApp_AnyFct_menu)
  {
    DemoApp_CallAnyFct(my_fct_name);
    return;
  }
  if(my_fct_name[0] == '&')
  {
    DemoApp_CallAnyFct(&my_fct_name[1]);
    return;
  }
#endif

}

/*******************************************************************************
** Syntax : void DemoApp_PrintChoices(void)                                   **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Non Reentrant                                              **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : print choices                                                **
*******************************************************************************/
void DemoApp_PrintChoices(void)
{
uint32 cnt;
uint32 cnt_max = DemoApp_Menu_p->size;
  print_f("\n");
  for (cnt=0;cnt<cnt_max;cnt++)
  {
    print_f(" <%s>: %s\n",DemoApp_Menu_p->list[cnt].fct_name,
                          DemoApp_Menu_p->list[cnt].fct_desc);
  }
}
/*******************************************************************************
** Syntax : void DemoApp_GotoDemoMenu(void)                                   **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Reentrant                                                  **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : Initializes the Menu Pointer to the Demo Menu.               **
*******************************************************************************/
void DemoApp_GotoDemoMenu(void)
{
  DemoApp_Menu_p = &DemoApp_DemoMenu;
}


#ifdef CALL_BY_FUNCTION_AVAILABLE
/*******************************************************************************
** Syntax : void DemoApp_GotoAnyFctMenu(void)                                 **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Reentrant                                                  **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : Initializes the Menu Pointer to the any Function Menu.       **
*******************************************************************************/
void DemoApp_GotoAnyFctMenu(void)
{
  DemoApp_Menu_p = &DemoApp_AnyFct_menu;
}
#endif
/*******************************************************************************
** Syntax : void DemoApp_GotoMainMenu(void)                                   **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Reentrant                                                  **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : Initializes the Menu Pointer to the Main Menu.               **
*******************************************************************************/
void DemoApp_GotoMainMenu(void)
{
  DemoApp_Menu_p = &DemoApp_MainMenu;
}
/*******************************************************************************
** Syntax : void DemoApp_DummyFct(void)                                       **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Reentrant                                                  **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : Dummy function to call when no operation has to be performed **
*******************************************************************************/
void DemoApp_DummyFct(void)
{
}

#ifdef CALL_BY_FUNCTION_AVAILABLE
/*******************************************************************************
** Syntax : void DemoApp_ListFct(void)                                        **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Reentrant                                                  **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : Function to list all the functions present                   **
*******************************************************************************/
void DemoApp_ListFct(void)
{
  uint32 cnt;
  uint32 cnt_max = DemoApp_AnyFctListSize;

  for (cnt=0;cnt<cnt_max;cnt++)
  {
    print_f("\n%d: ",cnt);
    print_f("%s",DemoApp_AllFctList[cnt].fct_name);
  }
  print_f("\n");
}

