smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/demoapp/src/DemoApp.c
/*******************************************************************************
** Syntax : void DemoApp_CallAnyFct(char *)                                   **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Non Reentrant                                              **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : call any SW function                                         **
*******************************************************************************/
void DemoApp_CallAnyFct (char *my_fct_name)
{

  uint32 cnt;
  uint32 return_val = 0;
  uint32 cnt_max    = DemoApp_AnyFctListSize;
  uint32 InputParamCnt;
  uint32 InputPtrParamCode = 0;
  cnt = DemoApp_GetIndex(my_fct_name,DemoApp_AllFctList,cnt_max);

  if(cnt<cnt_max)
  {

    /* print_f("found index number: %d\n",cnt); */

    if (sscanf(my_fct_name, "%s %lx %lx %lx %lx", fct_str, &uwData[0],         \
        &uwData[1], &uwData[2],                                                \
        &uwData[3]) == DemoApp_AllFctList[cnt].num_in_par + 1)
    {
      /* print_f("correct number of input parameter\n"); */
      /* from Tricore EABI (Embedded Applications Binary Interface): */
      /* Non-Pointer Arguments:
         Up to four 32-bit non-pointer arguments are passed in registers D[4]
         through D[7],
         with no more than one argument assigned per register.
         Integral arguments whose natural size in memory is less than 32-bits
         (characters and short integers) are expanded to 32-bits
         for purposes of argument passing.
      */
      /* Pointer Arguments:
         Up to four pointer arguments are passed in registers A[4] through A[7].
         Pointer arguments include the base address
         for arrays passed as arguments and
         for structure arguments whose size is greater than 64-bits.
      */
      if (DemoApp_AllFctList[cnt].num_in_par == 0)
      {
        return_val = ((uint32 (*) (void))DemoApp_AllFctList[cnt].fct_p)();
      }
      else
      {
        for (InputParamCnt = 0 ;
             InputParamCnt < DemoApp_AllFctList[cnt].num_in_par ;
             InputParamCnt++)
        {
          if(DemoApp_AllFctList[cnt].fct_in_par[InputParamCnt] == 33)
          {
            InputPtrParamCode = InputPtrParamCode | (1U<<InputParamCnt);
          }
        }
      }
      switch (InputPtrParamCode)
      {
        case 0:
        {
          return_val = ((uint32 (*) (uint32,uint32,uint32,uint32)) \
          DemoApp_AllFctList[cnt].fct_p)(uwData[0],uwData[1],uwData[2],
          uwData[3]);
          break;
        }
        case 1:
        {
          return_val = ((uint32 (*) (uint32*,uint32,uint32,uint32)) \
          DemoApp_AllFctList[cnt].fct_p)((uint32 *)uwData[0],uwData[1],uwData[2]
          ,uwData[3]);
          break;
        }
        case 2:
        {
          return_val = ((uint32 (*) (uint32,uint32*,uint32,uint32)) \
          DemoApp_AllFctList[cnt].fct_p)(uwData[0],(uint32 *)uwData[1],uwData[2]
          ,uwData[3]);
          break;
        }
        case 3:
        {
          return_val = ((uint32 (*) (uint32*,uint32*,uint32,uint32)) \
          DemoApp_AllFctList[cnt].fct_p)((uint32 *)uwData[0],(uint32 *)uwData[1]
          ,uwData[2],uwData[3]);
          break;
        }
        case 4:
        {
          return_val = ((uint32 (*) (uint32,uint32,uint32*,uint32)) \
          DemoApp_AllFctList[cnt].fct_p)(uwData[0],uwData[1],(uint32 *)uwData[2]
          ,uwData[3]);
          break;
        }
        case 5:
        {
          return_val = ((uint32 (*) (uint32*,uint32,uint32*,uint32)) \
          DemoApp_AllFctList[cnt].fct_p)((uint32 *)uwData[0],uwData[1],
          (uint32 *)uwData[2],uwData[3]);
          break;
        }
        case 6:
        {
          return_val = ((uint32 (*) (uint32,uint32*,uint32*,uint32)) \
          DemoApp_AllFctList[cnt].fct_p)(uwData[0],(uint32 *)uwData[1],
          (uint32 *)uwData[2],uwData[3]);
          break;
        }
        case 7:
        {
          return_val = ((uint32 (*) (uint32*,uint32*,uint32*,uint32)) \
          DemoApp_AllFctList[cnt].fct_p)((uint32 *)uwData[0],
          (uint32 *)uwData[1],(uint32 *)uwData[2],uwData[3]);
          break;
        }
        case 8:
        {
          return_val = ((uint32 (*) (uint32,uint32,uint32,uint32*)) \
          DemoApp_AllFctList[cnt].fct_p)(uwData[0],uwData[1],uwData[2],
          (uint32 *)uwData[3]);
          break;
        }
        case 9:
        {
          return_val = ((uint32 (*) (uint32*,uint32,uint32,uint32*)) \
          DemoApp_AllFctList[cnt].fct_p)((uint32 *)uwData[0],uwData[1],
          uwData[2],(uint32 *)uwData[3]);
          break;
        }
        case 10:
        {
          return_val = ((uint32 (*) (uint32,uint32*,uint32,uint32*)) \
          DemoApp_AllFctList[cnt].fct_p)(uwData[0],(uint32 *)uwData[1],
          uwData[2],(uint32 *)uwData[3]);
          break;
        }
        case 11:
        {
          return_val = ((uint32 (*) (uint32*,uint32*,uint32,uint32*)) \
          DemoApp_AllFctList[cnt].fct_p)((uint32 *)uwData[0],
          (uint32 *)uwData[1],uwData[2],(uint32 *)uwData[3]);
          break;
        }
        case 12:
        {
          return_val = ((uint32 (*) (uint32,uint32,uint32*,uint32*)) \
          DemoApp_AllFctList[cnt].fct_p)(uwData[0],uwData[1],
          (uint32 *)uwData[2],(uint32 *)uwData[3]);
          break;
        }
        case 13:
        {
          return_val = ((uint32 (*) (uint32*,uint32,uint32*,uint32*)) \
          DemoApp_AllFctList[cnt].fct_p)((uint32 *)uwData[0],uwData[1],
          (uint32 *)uwData[2],(uint32 *)uwData[3]);
          break;
        }
        case 14:
        {
          return_val = ((uint32 (*) (uint32,uint32*,uint32*,uint32*)) \
          DemoApp_AllFctList[cnt].fct_p)(uwData[0],(uint32 *)uwData[1],
          (uint32 *)uwData[2],(uint32 *)uwData[3]);
          break;
        }
        case 15:
        {
          return_val = ((uint32 (*) (uint32*,uint32*,uint32*,uint32*)) \
          DemoApp_AllFctList[cnt].fct_p)((uint32 *)uwData[0],
          (uint32 *)uwData[1],(uint32 *)uwData[2],(uint32 *)uwData[3]);
          break;
        }
        default:
        {
          print_f("The DemoApp only supports pointers up to the 4th position\n");
        }
      }

      if (DemoApp_AllFctList[cnt].out_par > 0)
      {
        print_f("return value:%x\n",return_val);
      }
    }
    else if (DemoApp_AllFctList[cnt].num_in_par > 4)
    {
      print_f("error:functions with more than 4 parameters are not supported\n\n");
    }
    else
    {
      print_f("error: incorrect number of input parameter !! \n\n");
    }
  }
  else if (cnt & 0x80000000)
  {
    cnt = cnt & 0x7FFFFFFF;
    print_f("The function does not exist!\nThe nearest index found: %d : %s\n",\
            cnt,DemoApp_AllFctList[cnt].fct_name);
  }

