smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/demoapp/src/DemoApp.c
}

/*******************************************************************************
** Syntax : void DemoApp_GetIndex(char *my_fct_name,                          **
**                                DemoApp_AnyFctListType const *list,         **
**                                uint32 list_size)                           **
**                                                                            **
** Service ID:   : NA                                                         **
**                                                                            **
** Sync/Async:   : Synchronous                                                **
**                                                                            **
** Reentrancy:   : Non Reentrant                                              **
**                                                                            **
** Parameters (in): my_fct_name  - Function Name                              **
**                  list - Pointer to the list for searching                  **
**                  list_size - size of the list                              **
** Parameters (out): none                                                     **
**                                                                            **
** Return value: none                                                         **
**                                                                            **
** Description : get index of a list with type DemoApp_AnyFctListType and     **
** return an ored value with 0x80000000 to give the nearest index if no exact **
** string was found                                                           **
*******************************************************************************/
uint32 DemoApp_GetIndex (char *my_fct_name,DemoApp_AnyFctListType const *list,
                         uint32 list_size)
{
uint32 idx_l;
uint8  idx_c;
uint32 best_idx_l=0;
uint8  best_idx_c=0;
uint32 found_idx = 0x80000000;

  /* loop on line */
  for(idx_l=0;idx_l<list_size;idx_l++)
  {
    idx_c=0;
    /*Loop on character in the line.Stop loop if one string arrives to the end*/
    while ( list->fct_name[idx_c] != 0 && my_fct_name[idx_c] != 0 && \
            my_fct_name[idx_c] != 0x20)
    {
      if (list->fct_name[idx_c] != my_fct_name[idx_c])
      {
        break; /* the 2 strings are not equal */
      }
      idx_c++;
    }
    if (list->fct_name[idx_c] == 0 && ( my_fct_name[idx_c] == 0 || \
        my_fct_name[idx_c] == 0x20))
    {
      /* found ! */
      found_idx = idx_l;
      break;
    }
    else
    {
      /* check if there are more good characters in this line */
      if(idx_c > best_idx_c)
        {
          best_idx_c = idx_c;
          best_idx_l = idx_l;
        }
    }
    list++;
  }
  /* if not found or the best line with 0x80000000 */
  if (found_idx == 0x80000000)
  {
    found_idx = 0x80000000 | best_idx_l;
  }
  return(found_idx);
}
#endif



